tests/stress.yaml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 10
  defaults:
    headers:
      Content-Type: 'application/json'
scenarios:
  - flow:
      - post:
          url: '/api/login'
          json:
            username: 'testuser'
            password: 'password'
      - get:
          url: '/api/products'